app/controllers/account_controller.rb

INSERT INTO `users` (`created_at`, `primarynumber`, `updated_at`, `username`, `countrycode`, `password_salt`, `areacode`, `password_hash`) VALUES('2011-01-20 00:30:14', '12345', '2011-01-20 00:30:14', 'bez', NULL, '702435595458600.481629858130355', NULL, '0021046692a8fc6745ef8af664a6305af0c8f1be')
---
  def register
    if request.post?
      @username = params[:username]
      @password = params[:password]
      @confirm_password = params[:password_confirmation]
      @ads_freq = params[:ads_freq]
      @categories = Category.find_all_by_id(params[:category_ids])
      @primarynumber = session[:primarynumber]
      @user = User.new(:username => @username, :password => @password, :password_confirmation => @password_confirmation, :primarynumber => @primarynumber)
      if @user.save!