app/controllers/accounts_controller.rb

  def edit
    @account = @user.account #.find_by_id(params[:id])
    @categories = Category.find(:all)
---
SELECT `categories`.id FROM `categories` WHERE (`categories`.`id` = 1) AND (`categories`.account_id = 18) LIMIT 1

  def create
    @user.create_account(params[:account])
    @account = @user.account

    respond_to do |format|
      if @account.save
---
INSERT INTO `accounts` (`created_at`, `updated_at`, `user_id`, `frequency`) VALUES('2011-01-23 05:49:02', '2011-01-23 05:49:02', NULL, NULL)
UPDATE `accounts` SET `updated_at` = '2011-01-24 01:54:43', `user_id` = NULL WHERE `id` = 7

  def update
    @account = @user.account #Account.find(params[:id])
    @account.categories = Category.find(params[:category_ids])

    respond_to do |format|
      if @account.update_attributes(params[:account])
---
SELECT * FROM `accounts` WHERE (`accounts`.user_id = 22) LIMIT 1
SELECT * FROM `categories` WHERE (`categories`.`id` IN ('1')) LIMIT 1
UPDATE `accounts` SET `updated_at` = '2011-01-23 22:23:37', `frequency` = 4 WHERE `id` = 3
UPDATE `categories` SET `updated_at` = '2011-01-28 01:35:24', `account_id` = 18 WHERE `id` = 1