app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`, `description`) VALUES('Sports', '2011-01-18 05:17:58', '2011-01-18 05:17:58', 'events, equipments and related stuff')

  def destroy
    @category = Category.find(params[:id])
    @category.destroy
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
DELETE FROM `categories` WHERE `id` = 1