app/controllers/rights_controller.rb

  def index
    @rights = Right.find(:all)
---
SELECT * FROM `rights` WHERE (controller = 'categories')

  def synch
    if @rights = Right.synchronize_with_controllers.find(:all)
---
INSERT INTO `rights` (`name`, `created_at`, `updated_at`, `action`, `controller`) VALUES('RightsController.synch', '2011-02-01 21:44:42', '2011-02-01 21:44:42', 'synch', 'rights')
SELECT * FROM `rights` WHERE (controller = 'categories')

  def show
    @right = Right.find(params[:id])
---
SELECT * FROM `rights` WHERE (`rights`.`id` = 1)

  def create
    @right = Right.new(params[:right])

    respond_to do |format|
      if @right.save
---
INSERT INTO `rights` (`name`, `created_at`, `updated_at`, `action`, `controller`) VALUES('CategoriesController.index', '2011-02-01 17:09:25', '2011-02-01 17:09:25', 'index', 'categories')

  def destroy
    @right = Right.find(params[:id])
---
SELECT * FROM `rights` WHERE (`rights`.`id` = 1)