app/controllers/roles_controller.rb

  def show
    @role = Role.find(params[:id])
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 1)

  def edit
    @role = Role.find(params[:id])
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 1)

  def create
    @role = Role.new(params[:role])

    respond_to do |format|
      if @role.save
---
INSERT INTO `roles` (`name`, `created_at`, `updated_at`) VALUES('Regular', '2011-02-01 16:59:44', '2011-02-01 16:59:44')

  def update
    @role = Role.find(params[:id])
    @role.rights = Right.find(params[:right_ids])
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 1)
SELECT * FROM `rights` INNER JOIN `rights_roles` ON `rights`.id = `rights_roles`.right_id WHERE (`rights_roles`.role_id = 1 )

  def destroy
    @role = Role.find(params[:id])
    @role.destroy
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 1)
DELETE FROM `roles` WHERE `id` = 1