app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all)

UPDATE `users` SET `updated_at` = '2011-01-23 05:30:19', `password_hash` = '83e76c71efdb7793b1410fb10f3443859e7de1dc', `password_salt` = '703132916817600.698026722598844' WHERE `id` = 21
---
  def update
    #@user = User.find_by_id(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

DELETE FROM `users` WHERE `id` = 1
---
  def destroy
    #@user = User.find_by_id(params[:id])
    @user.destroy